In [194]:
import pandas as pd

In [195]:
dataset=pd.read_csv(r"C:\Users\wwrao\OneDrive\Documents\Dataset_With_Duplicates.csv")
dataset

       Name   Age         City    Salary Joined_Date Target
0     Alice  25.0     New York   70000.0   1/10/2023    Yes
1       Bob  30.0  Los Angeles   80000.0   5/15/2023     No
2   Charlie  35.0      Chicago   90000.0   7/20/2023    Yes
3     Alice   NaN     New York       NaN         NaN    Yes
4     David  40.0      Seattle  100000.0  11/30/2022     No
5       NaN  22.0      Houston   60000.0   2/25/2023    Yes
6     Frank  33.0      Seattle   75000.0   3/15/2023     No
7     Grace  29.0      Chicago   85000.0   7/20/2023    Yes
8       Bob  30.0  Los Angeles   80000.0   5/15/2023     No
9     Alice  25.0     New York   70000.0   1/10/2023    Yes
10      Bob  30.0  Los Angeles   80000.0   5/15/2023     No

In [196]:
dataset.isnull().sum()

Name           1
Age            1
City           0
Salary         1
Joined_Date    1
Target         0
dtype: int64

In [197]:
dataset.duplicated()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8      True
9      True
10     True
dtype: bool

<h3>Remove duplicated value </h3>

In [198]:
dataset.duplicated().sum()

3

In [199]:
dataset.drop_duplicates(inplace=True)
dataset.duplicated().sum()

0

<h3>Remove the null value</h3>

In [200]:
dataset.isnull().sum()

Name           1
Age            1
City           0
Salary         1
Joined_Date    1
Target         0
dtype: int64

In [201]:
dataset["Name"][5]   #add value into null value in the name column

nan

In [202]:
dataset["Name"].fillna("Sami",inplace=True)

In [203]:

dataset["Age"].fillna(dataset["Age"].median(), inplace=True)       #add in the age column on behalf on median 

dataset["Salary"].fillna(dataset["Salary"].mean(), inplace=True)  

dataset["Age"][4],dataset["Salary"][4]

(40.0, 100000.0)

<h3>Delete unwanted column</h3>

In [204]:
dataset.drop(columns=["Joined_Date"],inplace=True)

**After**

In [205]:
dataset.isnull().sum()

Name      0
Age       0
City      0
Salary    0
Target    0
dtype: int64

In [193]:
dataset

      Name   Age         City    Salary Target
0    Alice  25.0     New York   70000.0    Yes
1      Bob  30.0  Los Angeles   80000.0     No
2  Charlie  35.0      Chicago   90000.0    Yes
3    Alice  30.0     New York   80000.0    Yes
4    David  40.0      Seattle  100000.0     No
5     Sami  22.0      Houston   60000.0    Yes
6    Frank  33.0      Seattle   75000.0     No
7    Grace  29.0      Chicago   85000.0    Yes